# MPA 5830 - Solutions for Task 02

Build out this notebook by creating Code cells that include commands to complete the following tasks.

(1) Read-in the data available here: https://aniruhil.github.io/avsr/teaching/dataviz/titanic3.xls and save it as `titanic`

In [1]:
library(tidyverse)

library(readxl)

read_excel(
    "data/titanic3.xls"
    ) -> titanic

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.1 ──

✔ ggplot2 3.3.5     ✔ purrr   0.3.4
✔ tibble  3.1.6     ✔ dplyr   1.0.7
✔ tidyr   1.1.4     ✔ stringr 1.4.0
✔ readr   2.0.2     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

Warning message in read_fun(path = enc2native(normalizePath(path)), sheet_i = sheet, :
“Coercing text to numeric in M1306 / R1306C13: '328'”

(2) Run the command that would show you the names of all columns/variables in `titanic`

In [2]:
names(titanic)

 [1] "pclass"    "survived"  "name"      "sex"       "age"       "sibsp"
 [7] "parch"     "ticket"    "fare"      "cabin"     "embarked"  "boat"
[13] "body"      "home.dest"

(3) Run the command that would show the descriptive statistics of each column/variable in `titanic`

In [3]:
summary(titanic)

     pclass         survived         name               sex
 Min.   :1.000   Min.   :0.000   Length:1309        Length:1309
 1st Qu.:2.000   1st Qu.:0.000   Class :character   Class :character
 Median :3.000   Median :0.000   Mode  :character   Mode  :character
 Mean   :2.295   Mean   :0.382
 3rd Qu.:3.000   3rd Qu.:1.000
 Max.   :3.000   Max.   :1.000

      age              sibsp            parch          ticket
 Min.   : 0.1667   Min.   :0.0000   Min.   :0.000   Length:1309
 1st Qu.:21.0000   1st Qu.:0.0000   1st Qu.:0.000   Class :character
 Median :28.0000   Median :0.0000   Median :0.000   Mode  :character
 Mean   :29.8811   Mean   :0.4989   Mean   :0.385
 3rd Qu.:39.0000   3rd Qu.:1.0000   3rd Qu.:0.000
 Max.   :80.0000   Max.   :8.0000   Max.   :9.000
 NA's   :263
      fare            cabin             embarked             boat
 Min.   :  0.000   Length:1309        Length:1309        Length:1309
 1st Qu.:  7.896   Class :character   Class :character   Class :character
 Median : 14.454   Mode  :character   Mode  :character   Mode  :character
 Mean   : 33.295
 3rd Qu.: 31.275
 Max.   :512.329
 NA's   :1
      body        home.dest
 Min.   :  1.0   Length:1309
 1st Qu.: 72.0   Class :character
 Median :155.0   Mode  :character
 Mean   :160.8
 3rd Qu.:256.0
 Max.   :328.0
 NA's   :1188

(4) For each of the following variables, add the labels provided     

    `pclass` (1 = First Class; 2 = Second Class;  3 = Third Class)

    `embarked` (C = Cherbourg; S = Southampton; Q = Queenstown)
    
    `survived` (0 = Did not survive; 1 = Survived)

In [4]:
titanic %>%
    mutate(
        pclass.f = factor(
            pclass, 
            levels = c(1, 2, 3), 
            labels = c("First Class", "Second Class", "Third Class")
        ),
        survived.f = factor(
            survived, 
            levels = c(0, 1), 
            labels = c("Did not survive", "Survived")
        ),
        embarked.f = case_when(
            embarked == "C" ~ "Cherbourg",
            embarked == "S" ~ "Southampton",
            embarked == "Q" ~ "Queenstown"
        )
    ) -> titanic

In [5]:
head(titanic)

  pclass survived name                                            sex
1 1      1        Allen, Miss. Elisabeth Walton                   female
2 1      1        Allison, Master. Hudson Trevor                  male
3 1      0        Allison, Miss. Helen Loraine                    female
4 1      0        Allison, Mr. Hudson Joshua Creighton            male
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female
6 1      1        Anderson, Mr. Harry                             male
  age     sibsp parch ticket fare     cabin   embarked boat body
1 29.0000 0     0     24160  211.3375 B5      S        2     NA
2  0.9167 1     2     113781 151.5500 C22 C26 S        11    NA
3  2.0000 1     2     113781 151.5500 C22 C26 S        NA    NA
4 30.0000 1     2     113781 151.5500 C22 C26 S        NA   135
5 25.0000 1     2     113781 151.5500 C22 C26 S        NA    NA
6 48.0000 0     0     19952   26.5500 E12     S        3     NA
  home.dest                       pclass.f    survived.f      embarked.f
1 St Louis, MO                    First Class Survived        Southampton
2 Montreal, PQ / Chesterville, ON First Class Survived        Southampton
3 Montreal, PQ / Chesterville, ON First Class Did not survive Southampton
4 Montreal, PQ / Chesterville, ON First Class Did not survive Southampton
5 Montreal, PQ / Chesterville, ON First Class Did not survive Southampton
6 New York, NY                    First Class Survived        Southampton

(5) Create a grouped version of `age` such that the resulting age groups are 0-18, 18-36, 36-54, 54-72, 72-90. Call this grouped variable `age_groups`

In [6]:
library(santoku)

Attaching package: ‘santoku’


The following object is masked from ‘package:tidyr’:

    chop

In [7]:
titanic %>%
    mutate(
        age_groups = chop(age, c(0, 18, 36, 54, 72, 90), labels = lbl_dash())
    ) -> titanic

titanic %>%
    group_by(age_groups) %>%
    tally()

  age_groups n
1 0 - 18     154
2 18 - 36    570
3 36 - 54    245
4 54 - 72     74
5 72 - 90      3
6 NA         263

(6) Create a new factor that has two values -- (1) whether the passenger was traveling 1st Class or (2) the passenger was traveling by either 2nd or 3rd Class. Call this new variable `class`

In [8]:
titanic %>%
    mutate(
        class = case_when(
            pclass == 1 ~ "First Class",
            pclass %in% c(2, 3) ~ "Second or Third Class"
        )
    ) -> titanic

titanic %>%
    group_by(pclass.f, class) %>%
    tally()

  pclass.f     class                 n
1 First Class  First Class           323
2 Second Class Second or Third Class 277
3 Third Class  Second or Third Class 709

(7) Create a tally of how many passengers embarked from each port. Which embarkation port had the most versus the least passengers?

In [9]:
titanic %>%
    group_by(embarked.f) %>%
    tally()

  embarked.f  n
1 Cherbourg   270
2 Queenstown  123
3 Southampton 914
4 NA            2

Looks like Southampton boarded the most passengers and Queenstown the least.

(8) Create a tally of how many passengers of each pclass embarked from each port. Which embarkation port had the most First Class versus Second Class versus Third Class passengers?

In [10]:
titanic %>%
    group_by(embarked.f, pclass.f) %>%
    tally()

   embarked.f  pclass.f     n
1  Cherbourg   First Class  141
2  Cherbourg   Second Class  28
3  Cherbourg   Third Class  101
4  Queenstown  First Class    3
5  Queenstown  Second Class   7
6  Queenstown  Third Class  113
7  Southampton First Class  177
8  Southampton Second Class 242
9  Southampton Third Class  495
10 NA          First Class    2

Southampton had the most First class, second class, and third class passengers.

(9) Create a small data-set that only retains male passengers embarking from Southampton. Show the results of the `summary()` command when run on this new data-set

In [11]:
titanic %>%
    filter(
        sex == "male", embarked.f == "Southampton"
    ) -> titanic02

In [12]:
summary(titanic02)

     pclass         survived          name               sex
 Min.   :1.000   Min.   :0.0000   Length:623         Length:623
 1st Qu.:2.000   1st Qu.:0.0000   Class :character   Class :character
 Median :3.000   Median :0.0000   Mode  :character   Mode  :character
 Mean   :2.414   Mean   :0.1701
 3rd Qu.:3.000   3rd Qu.:0.0000
 Max.   :3.000   Max.   :1.0000

      age              sibsp            parch           ticket
 Min.   : 0.3333   Min.   :0.0000   Min.   :0.0000   Length:623
 1st Qu.:21.0000   1st Qu.:0.0000   1st Qu.:0.0000   Class :character
 Median :28.0000   Median :0.0000   Median :0.0000   Mode  :character
 Mean   :29.9424   Mean   :0.4302   Mean   :0.2584
 3rd Qu.:38.0000   3rd Qu.:0.0000   3rd Qu.:0.0000
 Max.   :80.0000   Max.   :8.0000   Max.   :9.0000
 NA's   :105
      fare            cabin             embarked             boat
 Min.   :  0.000   Length:623         Length:623         Length:623
 1st Qu.:  7.896   Class :character   Class :character   Class :character
 Median : 10.500   Mode  :character   Mode  :character   Mode  :character
 Mean   : 21.842
 3rd Qu.: 26.000
 Max.   :263.000
 NA's   :1
      body        home.dest                 pclass.f             survived.f
 Min.   :  1.0   Length:623         First Class :108   Did not survive:517
 1st Qu.: 89.0   Class :character   Second Class:149   Survived       :106
 Median :155.0   Mode  :character   Third Class :366
 Mean   :163.1
 3rd Qu.:259.0
 Max.   :322.0
 NA's   :538
  embarked.f          age_groups     class
 Length:623         0 - 18 : 66   Length:623
 Class :character   18 - 36:296   Class :character
 Mode  :character   36 - 54:123   Mode  :character
                    54 - 72: 31
                    72 - 90:  2
                    NA's   :105

  

(10) Save the data-set in the RData format.

In [13]:
save(titanic, file = "data/titanic.RData")

In [14]:
save(titanic02, file = "data/titanic02.RData")